Output from Terraform plan before Apply
```[command]/home/runner/work/_temp/10e98162-8218-46e4-b88f-fef838f19bdf/terraform-bin plan -refresh=false -no-color -out=plan
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["0"] will be created
  + resource "azurerm_automation_job_schedule" "job_schedules" {
      + automation_account_name = "t2-oasys-automation-account"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + resource_group_name     = "t2-oasys"
      + runbook_name            = "start-vms"
      + schedule_name           = "weekdays 6am"
    }

  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["1"] will be created
  + resource "azurerm_automation_job_schedule" "job_schedules" {
      + automation_account_name = "t2-oasys-automation-account"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + resource_group_name     = "t2-oasys"
      + runbook_name            = "stop-vms"
      + schedule_name           = "weekdays 7pm"
    }

  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 6am"] will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedules" {
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/schedules/weekdays 6am"
        name                    = "weekdays 6am"
      ~ week_days               = [
          + "Friday",
          + "Monday",
          + "Thursday",
          + "Tuesday",
          + "Wednesday",
        ]
        # (8 unchanged attributes hidden)
    }

  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 7pm"] will be created
  + resource "azurerm_automation_schedule" "schedules" {
      + automation_account_name = "t2-oasys-automation-account"
      + expiry_time             = (known after apply)
      + frequency               = "week"
      + id                      = (known after apply)
      + interval                = (known after apply)
      + name                    = "weekdays 7pm"
      + resource_group_name     = "t2-oasys"
      + start_time              = (known after apply)
      + timezone                = "UTC"
      + week_days               = [
          + "Friday",
          + "Monday",
          + "Thursday",
          + "Tuesday",
          + "Wednesday",
        ]
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan"
Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 0.
::debug::stdout: Acquiring state lock. This may take a few moments...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["0"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "t2-oasys"%0A      + runbook_name            = "start-vms"%0A      + schedule_name           = "weekdays 6am"%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["1"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "t2-oasys"%0A      + runbook_name            = "stop-vms"%0A      + schedule_name           = "weekdays 7pm"%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 6am"] will be updated in-place%0A  ~ resource "azurerm_automation_schedule" "schedules" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/schedules/weekdays 6am"%0A        name                    = "weekdays 6am"%0A      ~ week_days               = [%0A          + "Friday",%0A          + "Monday",%0A          + "Thursday",%0A          + "Tuesday",%0A          + "Wednesday",%0A        ]%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 7pm"] will be created%0A  + resource "azurerm_automation_schedule" "schedules" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + expiry_time             = (known after apply)%0A      + frequency               = "week"%0A      + id                      = (known after apply)%0A      + interval                = (known after apply)%0A      + name                    = "weekdays 7pm"%0A      + resource_group_name     = "t2-oasys"%0A      + start_time              = (known after apply)%0A      + timezone                = "UTC"%0A      + week_days               = [%0A          + "Friday",%0A          + "Monday",%0A          + "Thursday",%0A          + "Tuesday",%0A          + "Wednesday",%0A        ]%0A    }%0A%0APlan: 3 to add, 1 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan"%0AReleasing state lock. This may take a few moments...%0A
::debug::stderr: 
::debug::exitcode: 0
::set-output name=stdout::Acquiring state lock. This may take a few moments...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["0"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "t2-oasys"%0A      + runbook_name            = "start-vms"%0A      + schedule_name           = "weekdays 6am"%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["1"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "t2-oasys"%0A      + runbook_name            = "stop-vms"%0A      + schedule_name           = "weekdays 7pm"%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 6am"] will be updated in-place%0A  ~ resource "azurerm_automation_schedule" "schedules" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/schedules/weekdays 6am"%0A        name                    = "weekdays 6am"%0A      ~ week_days               = [%0A          + "Friday",%0A          + "Monday",%0A          + "Thursday",%0A          + "Tuesday",%0A          + "Wednesday",%0A        ]%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 7pm"] will be created%0A  + resource "azurerm_automation_schedule" "schedules" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + expiry_time             = (known after apply)%0A      + frequency               = "week"%0A      + id                      = (known after apply)%0A      + interval                = (known after apply)%0A      + name                    = "weekdays 7pm"%0A      + resource_group_name     = "t2-oasys"%0A      + start_time              = (known after apply)%0A      + timezone                = "UTC"%0A      + week_days               = [%0A          + "Friday",%0A          + "Monday",%0A          + "Thursday",%0A          + "Tuesday",%0A          + "Wednesday",%0A        ]%0A    }%0A%0APlan: 3 to add, 1 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan"%0AReleasing state lock. This may take a few moments...%0A
::set-output name=stderr::
::set-output name=exitcode::0
```